# Parameter Type Id Viewer Reference Label Text Property

Source: https://www.revitapidocs.com/2026/1dc2ade1-c2d8-db53-58ab-a7b8cf6c3a62.htm

---

| Parameter Type Id Viewer Reference Label Text Property |
| --- |

"Default Reference Label"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ViewerReferenceLabelText { get; }
```

```
Public Shared ReadOnly Property ViewerReferenceLabelText As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ViewerReferenceLabelText {
	ForgeTypeId^ get ();
}
```

```
static member ViewerReferenceLabelText : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace